Revit 2027 API
Ceiling.GetCeilingGridLines Method
 Get the geometric representation of the ceiling grid, optionally including the ceiling boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetCeilingGridLines(
	bool includeBoundary
)
Public Function GetCeilingGridLines (
	includeBoundary As Boolean
) As IList(Of Curve)
public:
IList<Curve^>^ GetCeilingGridLines(
	bool includeBoundary
)
member GetCeilingGridLines :
        includeBoundary : bool -> IList<Curve>
Parameters
includeBoundary Boolean
 Include the boundary of the ceiling with the grid lines.
Return Value
IList<Curve>
 The curves representing the ceiling grid, optionally including the ceiling boundary.
See Also
Reference
Ceiling Class
Autodesk.Revit.DB Namespace